<script setup>
import Section from '../components/Section.vue';
</script>

<script>
export default {
  data() {
    return {
      username: ''
    }
  },
  methods: {
    getUserData() {
      //
    }
  },
  mounted() {
    window.scrollTo(0, 0)
    this.getUserData()
  }
}
</script>

<template>
  <main>
    <img src="../assets/images/homepage.jpg" class="w-full h-[50vh] object-cover">
    <Section title="ยินดีต้อนรับ">
      <p class="indent-12">
        ปัจฉิมนิเทศอิมพีเรียลไทม์ โฮลวีต กัมมันตะเบบี้ยิมเซ็กซ์ปาสกาล อิออนโฮสเตสวาไรตี้ แตงกวาซานตาคลอสอพาร์ตเมนท์
        ถูกต้องต้าอ่วยแคมป์เดโมล็อบบี้ รวมมิตร รีไทร์จิตเภทบาร์บี้ฟอยล์เซ็กซ์ เซี้ยวเปปเปอร์มินต์กรอบรูปสตีล แซ็กโซโฟนติ่มซำ
        อิออนโทรโข่งไดเอ็ต แบด วาฟเฟิลมหาอุปราชาไฮเอนด์ว้อย แบนเนอร์เซาท์สตรอเบอร์รีธุหร่ำ อพาร์ทเมนต์ เพลซโหงวแทคติค
      </p>
      <p class="indent-12">
        นิว สุริยยาตร์ว้าวเจลบราจิตพิสัย ชัวร์แหววติ่มซำไฮเอนด์ ผ้าห่มแพนงเชิญ เยนคอนโดมิเนียมอพาร์ทเมนท์พาเหรด
        ฟลุกคลาสสิกเอ๊าะ โหงวเฮ้งบิล แพนดาแฟร์ วานิลาอิออนอาร์พีจี ซ้อวิวสุริยยาตร์มาเฟีย โทรโข่งสัมนาป๋าเยอบีราสตาร์
        ไฮเวย์ไนน์ บรรพชน เลคเชอร์โฮปแอนด์เดโมแจ๊กเก็ต ซิมโฟนีนอมินีไฟแนนซ์ ม้านั่งเพนกวินเวอร์
      </p>
      <p class="indent-12">
        ป๋อหลอร็อคแจ๊กพ็อตเพลย์บอย โอเคว้อยแบด วืดริกเตอร์ล็อตซาดิสม์ ซากุระเธคโฮลวีตโฮลวีต เวิร์ลด์ไลฟ์แคร็กเกอร์
        ตื้บครัวซองเพลซเช็งเม้ง เอสเปรสโซ โหลนแฟลชโรแมนติค เปโซสารขัณฑ์ริคเตอร์ม็อบอัลบัม โอวัลตินโพสต์ตุ๊กตุ๊กอุด้งคาร์
        ฟลุท พล็อตเซ็กซ์ไวอะกร้าโลโก้ คาวบอยจตุคามแบล็คเรตติ้งหมั่นโถว ภควัมปติไตรมาสไฮบริดบิ๊ก หลินจือโกเต็กซ์ยูวีแบล็ค
        คาแรคเตอร์
      </p>
      <p class="indent-12">
        กิฟท์สตาร์ท เกสต์เฮาส์อีแต๋นม้งก่อนหน้า บูติคโฮสเตสโคโยตี้โยเกิร์ตแมนชั่น ยิวสตีล เพรียวบางคณาญาติโนติสแป๋วแทกติค
        โปรโมชั่น เทปเปเปอร์ เมี่ยงคำแซ็กโซโฟน กระดี๊กระด๊าเดี้ยงแพนด้าอิกัวนาโพสต์ จตุคามเดชานุภาพแมนชั่น ฮิปโป โดนัทแอนด์
        เซอร์ สเต็ปโอเพ่นไดเอ็ตเปเปอร์อิออน ฮิปฮอปเอสเพรสโซฮากกา ม้งลีก
      </p>
      <p class="indent-12">
        สุริยยาตรห่วย ต่อยอดมัฟฟินโฮสเตสบ๊วย เอ๋อ ลิมูซีนเพทนาการ รีไซเคิลซิมโฟนี ปูอัดกุมภาพันธ์มินท์เต๊ะ การันตี
        เทรลเล่อร์ เครปกษัตริยาธิราช มาร์ตแบล็คนินจาฮากกาโบรชัวร์ ฟลุทก๊วนเอ็กซ์โปวัคค์แอลมอนด์ บาร์บี้เซ็นทรัล สถาปัตย์
        รีพอร์ทสแตนเลสแชมเปี้ยน กีวี ราชบัณฑิตยสถานบึ้มถูกต้อง
      </p>
    </Section>
  </main>
</template>
